DiegoRuiz-Floow-Loop/PCBA_Firmware/flc_evk/STM32L431/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2021 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"
#include "stm32l4xx_ll_tim.h"
#include "stm32l4xx_ll_system.h"
#include "stm32l4xx_ll_gpio.h"
#include "stm32l4xx_ll_exti.h"
#include "stm32l4xx_ll_bus.h"
#include "stm32l4xx_ll_cortex.h"
#include "stm32l4xx_ll_rcc.h"
#include "stm32l4xx_ll_utils.h"
#include "stm32l4xx_ll_pwr.h"
#include "stm32l4xx_ll_dma.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define XI_USER_BTN_Pin LL_GPIO_PIN_13
#define XI_USER_BTN_GPIO_Port GPIOC
#define XI_USER_BTN_EXTI_IRQn EXTI15_10_IRQn
#define ADC_ITEM_1_Pin LL_GPIO_PIN_0
#define ADC_ITEM_1_GPIO_Port GPIOC
#define ADC_ITEM_2_Pin LL_GPIO_PIN_1
#define ADC_ITEM_2_GPIO_Port GPIOC
#define ADC_ITEM_3_Pin LL_GPIO_PIN_3
#define ADC_ITEM_3_GPIO_Port GPIOC
#define PWM_1_Pin LL_GPIO_PIN_0
#define PWM_1_GPIO_Port GPIOA
#define ADC_ITEM_4_Pin LL_GPIO_PIN_1
#define ADC_ITEM_4_GPIO_Port GPIOA
#define ADC_ITEM_5_Pin LL_GPIO_PIN_2
#define ADC_ITEM_5_GPIO_Port GPIOA
#define ADC_VBAT_Pin LL_GPIO_PIN_3
#define ADC_VBAT_GPIO_Port GPIOA
#define ADC_VEXT_Pin LL_GPIO_PIN_4
#define ADC_VEXT_GPIO_Port GPIOA
#define ADC_TEMP_Pin LL_GPIO_PIN_5
#define ADC_TEMP_GPIO_Port GPIOA
#define DO_DC_DC_EN_Pin LL_GPIO_PIN_0
#define DO_DC_DC_EN_GPIO_Port GPIOB
#define DO_MEM_PWR_EN_Pin LL_GPIO_PIN_1
#define DO_MEM_PWR_EN_GPIO_Port GPIOB
#define DO_LED_GREEN_Pin LL_GPIO_PIN_12
#define DO_LED_GREEN_GPIO_Port GPIOE
#define XI_ITEM_IN_1_Pin LL_GPIO_PIN_14
#define XI_ITEM_IN_1_GPIO_Port GPIOE
#define XI_ITEM_IN_1_EXTI_IRQn EXTI15_10_IRQn
#define XI_ITEM_IN_2_Pin LL_GPIO_PIN_15
#define XI_ITEM_IN_2_GPIO_Port GPIOE
#define XI_ITEM_IN_2_EXTI_IRQn EXTI15_10_IRQn
#define XI_ITEM_IN_3_Pin LL_GPIO_PIN_10
#define XI_ITEM_IN_3_GPIO_Port GPIOB
#define XI_ITEM_IN_3_EXTI_IRQn EXTI15_10_IRQn
#define XI_ITEM_IN_4_Pin LL_GPIO_PIN_11
#define XI_ITEM_IN_4_GPIO_Port GPIOB
#define XI_ITEM_IN_4_EXTI_IRQn EXTI15_10_IRQn
#define XI_ITEM_IN_5_Pin LL_GPIO_PIN_12
#define XI_ITEM_IN_5_GPIO_Port GPIOB
#define XI_ITEM_IN_5_EXTI_IRQn EXTI15_10_IRQn
#define DO_ITEM_OUT_1_Pin LL_GPIO_PIN_13
#define DO_ITEM_OUT_1_GPIO_Port GPIOB
#define DO_ITEM_OUT_2_Pin LL_GPIO_PIN_14
#define DO_ITEM_OUT_2_GPIO_Port GPIOB
#define DO_ITEM_OUT_3_P_Pin LL_GPIO_PIN_15
#define DO_ITEM_OUT_3_P_GPIO_Port GPIOB
#define DO_SPI_DFLASH_CS_Pin LL_GPIO_PIN_9
#define DO_SPI_DFLASH_CS_GPIO_Port GPIOD
#define DI_PWR_SEL_Pin LL_GPIO_PIN_7
#define DI_PWR_SEL_GPIO_Port GPIOC
#define DI_CONFIG_0_Pin LL_GPIO_PIN_8
#define DI_CONFIG_0_GPIO_Port GPIOC
#define DI_CONFIG_1_Pin LL_GPIO_PIN_9
#define DI_CONFIG_1_GPIO_Port GPIOC
#define DO_ITEM_OUT_3_N_Pin LL_GPIO_PIN_8
#define DO_ITEM_OUT_3_N_GPIO_Port GPIOA
#define U1_EXT_TXD_Pin LL_GPIO_PIN_9
#define U1_EXT_TXD_GPIO_Port GPIOA
#define U1_EXT_RXD_Pin LL_GPIO_PIN_10
#define U1_EXT_RXD_GPIO_Port GPIOA
#define U2_SIF_RX_Pin LL_GPIO_PIN_15
#define U2_SIF_RX_GPIO_Port GPIOA
#define DI_HWREV_0_Pin LL_GPIO_PIN_10
#define DI_HWREV_0_GPIO_Port GPIOC
#define DI_HWREV_1_Pin LL_GPIO_PIN_11
#define DI_HWREV_1_GPIO_Port GPIOC
#define DO_EN_MEASURE_Pin LL_GPIO_PIN_12
#define DO_EN_MEASURE_GPIO_Port GPIOC
#define DO_ITEM_OUT_4_P_Pin LL_GPIO_PIN_0
#define DO_ITEM_OUT_4_P_GPIO_Port GPIOD
#define DO_ITEM_OUT_4_N_Pin LL_GPIO_PIN_1
#define DO_ITEM_OUT_4_N_GPIO_Port GPIOD
#define DO_ITEM_OUT_5_P_Pin LL_GPIO_PIN_2
#define DO_ITEM_OUT_5_P_GPIO_Port GPIOD
#define DO_ITEM_OUT_5_N_Pin LL_GPIO_PIN_3
#define DO_ITEM_OUT_5_N_GPIO_Port GPIOD
#define DO_LED_RGB_B_Pin LL_GPIO_PIN_4
#define DO_LED_RGB_B_GPIO_Port GPIOD
#define U2_SIF_TX_Pin LL_GPIO_PIN_5
#define U2_SIF_TX_GPIO_Port GPIOD
#define DO_LED_RGB_R_Pin LL_GPIO_PIN_6
#define DO_LED_RGB_R_GPIO_Port GPIOD
#define DO_LED_RGB_G_Pin LL_GPIO_PIN_7
#define DO_LED_RGB_G_GPIO_Port GPIOD
#define PWM_2_Pin LL_GPIO_PIN_3
#define PWM_2_GPIO_Port GPIOB
#define DO_GSM_PWR_KEY_Pin LL_GPIO_PIN_4
#define DO_GSM_PWR_KEY_GPIO_Port GPIOB
#define DO_EXT_POWER_ENABLE_Pin LL_GPIO_PIN_6
#define DO_EXT_POWER_ENABLE_GPIO_Port GPIOB
#define DO_EXT_LOG_SEL_Pin LL_GPIO_PIN_7
#define DO_EXT_LOG_SEL_GPIO_Port GPIOB
#define BOOT0_Pin LL_GPIO_PIN_3
#define BOOT0_GPIO_Port GPIOH
#define I2C1_SCL_Pin LL_GPIO_PIN_8
#define I2C1_SCL_GPIO_Port GPIOB
#define I2C1_SDA_Pin LL_GPIO_PIN_9
#define I2C1_SDA_GPIO_Port GPIOB
#define XI_GSM_STATUS_Pin LL_GPIO_PIN_0
#define XI_GSM_STATUS_GPIO_Port GPIOE
#define XI_GSM_STATUS_EXTI_IRQn EXTI0_IRQn
void   MX_IWDG_Init(void);
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
